nxp-mcuxpresso/mcux-component/power_manager/devices/MCXN94x/fsl_pm_device.c
/*
 * Copyright 2023-2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <setjmp.h>

#include "fsl_pm_device.h"
#include "fsl_pm_core.h"
#include "fsl_pm_device_config.h"

#include "fsl_cmc.h"
#include "fsl_spc.h"
#include "fsl_wuu.h"
#include "fsl_clock.h"
#include "fsl_vbat.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Macros
 ******************************************************************************/
#define WUU_PIN_FLAG_MASK WUU_PF_WUF7_MASK

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
typedef struct _resource_recode resource_recode_t;

static void EnterLowPowerMode(uint8_t stateIndex, pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup);
static void CleanExitLowPowerMode(void);
static void SetSRAMOperateMode(uint8_t operateMode, resource_recode_t *pResourceRecode);
static void SetAnalogOperateMode(uint8_t operateMode, resource_recode_t *pResourceRecode);
void EnableResources(pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup);

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
static status_t ManageWakeupSource(pm_wakeup_source_t *ws, bool enable);
static bool IsWakeupSource(pm_wakeup_source_t *ws);
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */

/*******************************************************************************
 * Variables
 ******************************************************************************/
AT_ALWAYS_ON_DATA_INIT(extern resource_recode_t resourceDB[PM_CONSTRAINT_COUNT]);
AT_ALWAYS_ON_DATA_INIT(cmc_power_domain_config_t g_mainWakePDConfig) = {
    .clock_mode = kCMC_GateAllSystemClocksEnterLowPowerMode,
    /* we chose to put the main and wake domain in retention (deep sleep) by default if no constraints are set */
    .main_domain = kCMC_DeepSleepMode,
    .wake_domain = kCMC_DeepSleepMode,
};

/*!
 *  |----------------|-------------|------------|------------|------------|------------|------------|
 *  |                |             |            |       Power Down        |    Deep    |            |
 *  | Module         |    Sleep    | Deep Sleep | WAKE DSlp. | WAKE PDown | Power Down |    VBAT    |
 *  |----------------|-------------|------------|------------|------------|------------|------------|
 *  | CM33           |    Static   |   Static   |   Static   |   Static   |     Off    |    Off     |
 *  | Bus/System Clk |     On      |   Static   |   Static   |   Static   |     Off    |    Off     |
 *  | VDD_CORE_MAIN  |     On      |     LP     |   Static   |   Static   |     Off    |    Off     |
 *  | VDD_CORE_WAKE  |     On      |     LP     |     LP     |   Static   |     Off    |    Off     |
 *  | RAMA SRAM      | On/Stat/Off | Static/Off | Static/Off | Static/Off | Static/Off | Static/Off |
 *  | System SRAMs   |    On/Off   |   Static   | Static/Off | Static/Off |     Off    |    Off     |
 *  | Flash          |    On/LP    |     LP     |    Off     |    Off     |     Off    |    Off     |
 *  | DCDC/LDO_CORE  |    On/LP    |   On/LP    |   On/LP    |   On/LP    |     Off    |    Off     |
 *  | LDO/VDD_SYS    |    On/LP    |   On/LP    |   On/LP    |   On/LP    |    On/LP   |    Off     |
 *  | FRO_144M       |  Optional   |    Off     |    Off     |    Off     |     Off    |    Off     |
 *  | FRO_12M        |  Optional   |  Optional  |  Optional  |    Off     |     Off    |    Off     |
 *  | FRO_16K        |  Optional   |  Optional  |  Optional  |  Optional  |  Optional  |  Optional  |
 *  | OSC_RTC        |  Optional   |  Optional  |  Optional  |  Optional  |  Optional  |  Optional  |
 *  | OSC_SYS        |  Optional   |    Off     |    Off     |    Off     |     Off    |    Off     |
 *  | PLL0/1         |  Optional   |    Off     |    Off     |    Off     |     Off    |    Off     |
 *  | ADC            |  Optional   |    Off     |    Off     |    Off     |     Off    |    Off     |
 *  | CMP0/1         |  Optional   |  Optional  |  Optional  |  Optional  |  Optional  |    Off     |
 *  | CMP2           |  Optional   |  Optional  |  Optional  |    Off     |     Off    |    Off     |
 *  | DAC0/1         |  Optional   |  Optional  |   Static   |   Static   |     Off    |    Off     |
 *  | DAC2           |  Optional   |  Optional  |    Off     |    Off     |     Off    |    Off     |
 *  | OPAMP0/1/2     |  Optional   |  Optional  |    Off     |    Off     |     Off    |    Off     |
 *  | VREF           |  Optional   |  Optional  |   Static   |   Static   |     Off    |    Off     |
 *  | SINC Filter    |  Optional   |  Optional  |   Static   |   Static   |     Off    |    Off     |
 *  | USB 3V Detect  |  Optional   |  Optional  |  Optional  |  Optional  |     Off    |    Off     |
 *  | CORE Bandgap   |  On/LP/Off  |  On/LP/Off |  On/LP/Off |  On/LP/Off |     Off    |    Off     |
 *  | CORE GlitchDet |  Optional   |  Optional  |  Optional  |  Optional  |     Off    |    Off     |
 *  | VDD_CORE_HVD   |  Optional   |  Optional  |  Optional  |  Optional  |     Off    |    Off     |
 *  | VDD_CORE_LVD   |  Optional   |  Optional  |  Optional  |  Optional  |     Off    |    Off     |
 *  | VDD_SYS_HVD    |  Optional   |  Optional  |  Optional  |  Optional  |  Optional  |    Off     |
 *  | VDD_SYS_LVD    |  Optional   |  Optional  |  Optional  |  Optional  |  Optional  |    Off     |
 *  | VDD_IO_LVD     |  Optional   |  Optional  |  Optional  |  Optional  |     Off    |    Off     |
 *  | VDD_IO_HVD     |  Optional   |  Optional  |  Optional  |  Optional  |     Off    |    Off     |
 *  | VDD_IO_Detect  |  Optional   |  Optional  |  Optional  |  Optional  |     Off    |    Off     |
 *  | VBAT Bandgap   |  Optional   |  Optional  |  Optional  |  Optional  |  Optional  |  Optional  |
 *  |----------------|-------------|------------|------------|------------|------------|------------|
 */

// ToDo Update all Exit Latencies to match datasheet
const pm_device_option_t g_devicePMOption = {
    .states =
        {
            /* Sleep */
            {
                .exitLatency = 14U, /* 14 us */
                .fixConstraintsMask =
                    {
                        .rescMask[0U] = ~(PM_MASK_RESC_LOWEST_SLEEP0),
                        .rescMask[1U] = ~(PM_MASK_RESC_LOWEST_SLEEP1),
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0U] = PM_MASK_RESC_LOWEST_SLEEP0 & PM_MASK_RESC_NOT_VAR0,
                        .rescMask[1U] = PM_MASK_RESC_LOWEST_SLEEP1 & PM_MASK_RESC_NOT_VAR1,
                    },
            },
            /* Deep Sleep */
            {
                .exitLatency = 14U, /* 14 us */
                .fixConstraintsMask =
                    {
                        .rescMask[0U] = ~(PM_MASK_RESC_LOWEST_DEEP_SLEEP0),
                        .rescMask[1U] = ~(PM_MASK_RESC_LOWEST_DEEP_SLEEP1),
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0U] = PM_MASK_RESC_LOWEST_DEEP_SLEEP0 & PM_MASK_RESC_NOT_VAR0,
                        .rescMask[1U] = PM_MASK_RESC_LOWEST_DEEP_SLEEP1 & PM_MASK_RESC_NOT_VAR1,
                    },
            },
            /* Power Down with CORE_WAKE in Deep Sleep*/
            {
                .exitLatency = 600U, /* 600 us */
                .fixConstraintsMask =
                    {
                        .rescMask[0U] = ~(PM_MASK_RESC_LOWEST_PDDS0),
                        .rescMask[1U] = ~(PM_MASK_RESC_LOWEST_PDDS1),
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0U] = PM_MASK_RESC_LOWEST_PDDS0 & PM_MASK_RESC_NOT_VAR0,
                        .rescMask[1U] = PM_MASK_RESC_LOWEST_PDDS1 & PM_MASK_RESC_NOT_VAR1,
                    },
            },
            /* Power Down with CORE_WAKE in Power Down*/
            {
                .exitLatency = 600U, /* 600 us */
                .fixConstraintsMask =
                    {
                        .rescMask[0U] = ~(PM_MASK_RESC_LOWEST_PDPD0),
                        .rescMask[1U] = ~(PM_MASK_RESC_LOWEST_PDPD1),
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0U] = PM_MASK_RESC_LOWEST_PDPD0 & PM_MASK_RESC_NOT_VAR0,
                        .rescMask[1U] = PM_MASK_RESC_LOWEST_PDPD1 & PM_MASK_RESC_NOT_VAR1,
                    },
            },
            /* Deep Power Down */
            {
                .fixConstraintsMask =
                    {
                        .rescMask[0U] = ~(PM_MASK_RESC_LOWEST_DPD0),
                        .rescMask[1U] = ~(PM_MASK_RESC_LOWEST_DPD1),
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0U] = PM_MASK_RESC_LOWEST_DPD0 & PM_MASK_RESC_NOT_VAR0,
                        .rescMask[1U] = PM_MASK_RESC_LOWEST_DPD1 & PM_MASK_RESC_NOT_VAR1,
                    },
            },
            /* VBAT */
            {
                .fixConstraintsMask =
                    {
                        .rescMask[0U] = ~(PM_MASK_RESC_LOWEST_VBAT0),
                        .rescMask[1U] = ~(PM_MASK_RESC_LOWEST_VBAT1),
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0U] = PM_MASK_RESC_LOWEST_VBAT0 & PM_MASK_RESC_NOT_VAR0,
                        .rescMask[1U] = PM_MASK_RESC_LOWEST_VBAT1 & PM_MASK_RESC_NOT_VAR1,
                    },
            },
        },
    .stateCount = PM_LP_STATE_COUNT,
    .enter      = EnterLowPowerMode,
    .clean      = CleanExitLowPowerMode,

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
    .manageWakeupSource = ManageWakeupSource,
    .isWakeupSource     = IsWakeupSource,
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */
};

struct _resource_recode
{
    uint8_t currentOperateMode : 4U;
    void (*resourceConfigFunc)(uint8_t operateMode, resource_recode_t *pResourceRecode);
};

