nxp-mcuxpresso/mcux-component/power_manager/devices/MCXN94x/fsl_pm_device.c
// Todo Remove all references to this placeholder, and remove the placeholder
static void PlaceHolderOperateMode(uint8_t operateMode, resource_recode_t *pResourceRecode)
{
}

/* Struct below stored in Always-On memory, to retain in all power modes*/
AT_ALWAYS_ON_DATA_INIT(resource_recode_t resourceDB[PM_CONSTRAINT_COUNT]) = {
    [kResc_SRAM_RAMA0_8K]      = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMA1_8K]      = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMA2_8K]      = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMA3_8K]      = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMX0_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMX1_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMX2_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMB0_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMC0_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMC1_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMD0_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMD1_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAME0_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAME1_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMF0_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMF1_32K]     = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMG01_32K]    = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMG23_32K]    = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_RAMH01_32K]    = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_LPCAC]         = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_DMA_PKC]       = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_USB0]          = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_PQ]            = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_CAN_ENET_USB1] = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_SRAM_FLEXSPI0]      = {PM_RESOURCE_FULL_ON, SetSRAMOperateMode},
    [kResc_Flash]              = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_DCDC_CORE]          = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_LDO_CORE]           = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_LDO_SYS]            = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_FRO_144M]           = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_FRO_12M]            = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_FRO_16K]            = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_OSC_RTC]            = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_OSC_SYS]            = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_PLL0]               = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_CMP0]               = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_CMP1]               = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_CMP2]               = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_DAC0]               = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_DAC1]               = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_DAC2]               = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_OPAMP0]             = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_OPAMP1]             = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_OPAMP2]             = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_VREF]               = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_USB3V_DET]          = {PM_RESOURCE_OFF, SetAnalogOperateMode},
    [kResc_ADC]                = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_SINC]               = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_BG_CORE]            = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_BG_VBAT]            = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_GDET]               = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_HVD_CORE]           = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_HVD_SYS]            = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_HVD_IO]             = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_LVD_CORE]           = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_LVD_SYS]            = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_LVD_IO]             = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
    [kResc_IO_Det]             = {PM_RESOURCE_OFF, PlaceHolderOperateMode},
};

/*******************************************************************************
 * Code
 ******************************************************************************/

static uint8_t FindOperateMode(uint32_t rescIndex, pm_resc_group_t *pSysRescGroup)
{
    assert(pSysRescGroup);
    uint8_t u8Tmp = (uint8_t)(uint32_t)(PM_RESC_GROUP(pSysRescGroup, rescIndex));

    u8Tmp |= (u8Tmp >> 1U);
    u8Tmp |= (u8Tmp >> 2U);

    return ((u8Tmp + 1U) >> 1U);
}

void EnableResources(pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup)
{
    assert(pSoftRescMask);
    assert(pSysRescGroup);

    uint32_t i;
    uint8_t opMode = PM_RESOURCE_OFF;

    for (i = 0UL; i < (uint32_t)PM_CONSTRAINT_COUNT; i++)
    {
        if (resourceDB[i].resourceConfigFunc != NULL)
        {
            opMode = FindOperateMode(i, pSysRescGroup);
            if (opMode != resourceDB[i].currentOperateMode)
            {
                resourceDB[i].resourceConfigFunc(opMode, &resourceDB[i]);
            }
        }
    }
}

static void EnterLowPowerMode(uint8_t stateIndex, pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup)
{
    assert(pSoftRescMask);
    assert(pSysRescGroup);

    switch (stateIndex)
    {
        case PM_LP_STATE_SLEEP:
        {
            g_mainWakePDConfig.clock_mode  = kCMC_GateCoreClock;
            g_mainWakePDConfig.main_domain = kCMC_ActiveOrSleepMode;
            g_mainWakePDConfig.wake_domain = kCMC_ActiveOrSleepMode;
            break;
        }
        case PM_LP_STATE_DEEP_SLEEP:
        {
            g_mainWakePDConfig.clock_mode  = kCMC_GateAllSystemClocksEnterLowPowerMode;
            g_mainWakePDConfig.main_domain = kCMC_DeepSleepMode;
            g_mainWakePDConfig.wake_domain = kCMC_DeepSleepMode;
            break;
        }
        case PM_LP_STATE_POWER_DOWN_WAKE_DS:
        {
            g_mainWakePDConfig.clock_mode  = kCMC_GateAllSystemClocksEnterLowPowerMode;
            g_mainWakePDConfig.main_domain = kCMC_PowerDownMode;
            g_mainWakePDConfig.wake_domain = kCMC_DeepSleepMode;
            break;
        }
        case PM_LP_STATE_POWER_DOWN_WAKE_PD:
        {
            g_mainWakePDConfig.clock_mode  = kCMC_GateAllSystemClocksEnterLowPowerMode;
            g_mainWakePDConfig.main_domain = kCMC_PowerDownMode;
            g_mainWakePDConfig.wake_domain = kCMC_PowerDownMode;
            break;
        }
        case PM_LP_STATE_DEEP_POWER_DOWN:
        case PM_LP_STATE_VBAT:
        {
            g_mainWakePDConfig.clock_mode  = kCMC_GateAllSystemClocksEnterLowPowerMode;
            g_mainWakePDConfig.main_domain = kCMC_DeepPowerDown;
            g_mainWakePDConfig.wake_domain = kCMC_DeepPowerDown;
            break;
        }
        default:
        {
            assert(0);
            break;
        }
    }

    EnableResources(pSoftRescMask, pSysRescGroup);
    CMC_SetPowerModeProtection(CMC0, (uint32_t)kCMC_AllowAllLowPowerModes);
    CMC_EnterLowPowerMode(CMC0, &g_mainWakePDConfig);
}

static void CleanExitLowPowerMode(void)
{
    if ((SPC_CheckPowerDomainLowPowerRequest(SPC0, kSPC_PowerDomain0) == true) &&
        (SPC_GetPowerDomainLowPowerMode(SPC0, kSPC_PowerDomain0) >= kSPC_PowerDownWithSysClockOff))
    {
        /* We need to release IO isolation when exiting from Power Down mode
         * This is done here after all peripherals have been reinitialized, to
         * avoid any glitch on IOs */
        SPC_ClearPeriphIOIsolationFlag(SPC0);
    }

    /* Clear SPC LP request status for next low power phase
     * The clean up API has been added because the modules registered to notification
     * could need to read some status registers
     * so we don't want a specific module to handle the clear of those status
     * as it could lead to some modules missing the status information
     * (depending on the notification order).
     * So this API is meant to clear everything needed for the platform once
     * every module got notified. */
    SPC_ClearPowerDomainLowPowerRequestFlag(SPC0, kSPC_PowerDomain0);
    SPC_ClearPowerDomainLowPowerRequestFlag(SPC0, kSPC_PowerDomain1);
    SPC_ClearLowPowerRequest(SPC0);
}

static void SetSRAMOperateMode(uint8_t operateMode, resource_recode_t *pResourceRecode)
{
    assert(pResourceRecode);

    uint32_t sramId;

