nxp-mcuxpresso/mcux-component/power_manager/devices/MCXN94x/fsl_pm_device.c
        case kResc_OPAMP2:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                CLOCK_EnableClock(kCLOCK_Opamp2);
                SPC_EnableActiveModeAnalogModules(SPC0, (uint32_t)kSPC_controlOpamp2);
                SPC_EnableLowPowerModeAnalogModules(SPC0, (uint32_t)kSPC_controlOpamp2);
            }
            else
            {
                CLOCK_DisableClock(kCLOCK_Opamp2);
                SPC_DisableActiveModeAnalogModules(SPC0, (uint32_t)kSPC_controlOpamp2);
                SPC_DisableLowPowerModeAnalogModules(SPC0, (uint32_t)kSPC_controlOpamp2);
            }
            break;

        case kResc_CMP0:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                SPC_EnableActiveModeAnalogModules(SPC0, ((uint32_t)kSPC_controlCmp0 | (uint32_t)kSPC_controlCmp0Dac));
                SPC_EnableLowPowerModeAnalogModules(SPC0, ((uint32_t)kSPC_controlCmp0 | (uint32_t)kSPC_controlCmp0Dac));
            }
            else
            {
                SPC_DisableActiveModeAnalogModules(SPC0, ((uint32_t)kSPC_controlCmp0 | (uint32_t)kSPC_controlCmp0Dac));
                SPC_DisableLowPowerModeAnalogModules(SPC0,
                                                     ((uint32_t)kSPC_controlCmp0 | (uint32_t)kSPC_controlCmp0Dac));
            }
            break;

        case kResc_CMP1:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                SPC_EnableActiveModeAnalogModules(SPC0, ((uint32_t)kSPC_controlCmp1 | (uint32_t)kSPC_controlCmp1Dac));
                SPC_EnableLowPowerModeAnalogModules(SPC0, ((uint32_t)kSPC_controlCmp1 | (uint32_t)kSPC_controlCmp1Dac));
            }
            else
            {
                SPC_DisableActiveModeAnalogModules(SPC0, ((uint32_t)kSPC_controlCmp1 | (uint32_t)kSPC_controlCmp1Dac));
                SPC_DisableLowPowerModeAnalogModules(SPC0,
                                                     ((uint32_t)kSPC_controlCmp1 | (uint32_t)kSPC_controlCmp1Dac));
            }
            break;

        case kResc_CMP2:
            if (operateMode == PM_RESOURCE_FULL_ON)
            {
                CLOCK_EnableClock(kCLOCK_Cmp2);
                SPC_EnableActiveModeAnalogModules(SPC0, ((uint32_t)kSPC_controlCmp2 | (uint32_t)kSPC_controlCmp2Dac));
                SPC_EnableLowPowerModeAnalogModules(SPC0, ((uint32_t)kSPC_controlCmp2 | (uint32_t)kSPC_controlCmp2Dac));
            }
            else
            {
                CLOCK_DisableClock(kCLOCK_Cmp2);
                SPC_DisableActiveModeAnalogModules(SPC0, ((uint32_t)kSPC_controlCmp2 | (uint32_t)kSPC_controlCmp2Dac));
                SPC_DisableLowPowerModeAnalogModules(SPC0,
                                                     ((uint32_t)kSPC_controlCmp2 | (uint32_t)kSPC_controlCmp2Dac));
            }
            break;

        default:
            assert(0U);
            break;
    }
    pResourceRecode->currentOperateMode = operateMode;
}

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
static status_t ManageWakeupSource(pm_wakeup_source_t *ws, bool enable)
{
    assert(ws);

    uint32_t inputType;
    uint32_t inputId;
    uint32_t irqn;
    uint32_t misc;

    PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);

    if (inputType == (uint32_t)kWup_inputType_extPin)
    {
        wuu_external_wakeup_pin_config_t pinConfig;

        pinConfig.edge  = enable ? (wuu_external_pin_edge_detection_t)misc : kWUU_ExternalPinDisable;
        pinConfig.event = kWUU_ExternalPinInterrupt;
        pinConfig.mode  = kWUU_ExternalPinActiveDSPD;

        WUU_SetExternalWakeUpPinsConfig(WUU0, (uint8_t)inputId, &pinConfig);

        if (enable)
        {
            (void)EnableIRQ((IRQn_Type)irqn);
            (void)EnableIRQ(WUU_IRQn);
        }
        else
        {
            (void)DisableIRQ((IRQn_Type)irqn);
            (void)DisableIRQ(WUU_IRQn);
        }
    }
    else
    {
        if (enable)
        {
            /* Wakeup source is internal module. */
            (void)EnableIRQ(WUU_IRQn);
            WUU_SetInternalWakeUpModulesConfig(WUU0, (uint8_t)inputId, kWUU_InternalModuleInterrupt);
            (void)EnableIRQ((IRQn_Type)irqn);
        }
        else
        {
            WUU0->ME &= ~(1UL << inputId);
            (void)DisableIRQ((IRQn_Type)irqn);
            (void)DisableIRQ(WUU_IRQn);
        }
    }

    return kStatus_Success;
}

static bool IsWakeupSource(pm_wakeup_source_t *ws)
{
    uint32_t inputType;
    uint32_t inputId;
    uint32_t irqn;
    uint32_t misc;
    uint32_t wuuPf;
    uint32_t mask;
    bool ret = false;

    assert(ws != NULL);

    PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);

    /* Wakeup source is external pin. */
    if (inputType == (uint32_t)kWup_inputType_extPin)
    {
        wuuPf = WUU_GetExternalWakeUpPinsFlag(WUU0);
        mask  = (1UL << inputId) & WUU_PIN_FLAG_MASK;

        if ((wuuPf * mask) != 0U)
        {
            /* This wake up source triggered the last wake up */
            ret = true;
        }
    }

    (void)irqn;
    (void)misc;

    return ret;
}
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER*/
